html/intepreter/lazy_evalutor.html
<div id="outline-container-orgfe75ec8" class="outline-4">
<h4 id="orgfe75ec8">修改 apply</h4>
<div class="outline-text-4" id="text-orgfe75ec8">
<p>
由于现在来自 <span class="underline">eval</span> 的是未求值的运算对象，在送给 <b>基本过程之前需要求出这些表达式的值</b> ：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">apply</span> procedure arguments env<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">cond</span> <span style="color: #696969;">((</span>primitive-procedure? procedure<span style="color: #696969;">)</span>
         <span style="color: #696969;">(</span>apply-primitive-procedure
          procedure
          <span style="color: #696969;">(</span>list-of-arg-values arguments env<span style="color: #696969;">)))</span>  <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#24378;&#36843;&#27714;&#20540;&#8220;&#22522;&#26412;&#36807;&#31243;&#25152;&#26377;&#21442;&#25968;&#8221;</span>
        <span style="color: #696969;">((</span>compound-procedure? procedure<span style="color: #696969;">)</span>
         <span style="color: #696969;">(</span>eval-sequence
          <span style="color: #696969;">(</span>procedure-body procedure<span style="color: #696969;">)</span>
          <span style="color: #696969;">(</span>extend-environment
           <span style="color: #696969;">(</span>procedure-parameters procedure<span style="color: #696969;">)</span>
           <span style="color: #696969;">(</span>list-of-delayed-args arguments env<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#24310;&#26102;&#27714;&#20540;&#8220;&#22797;&#21512;&#36807;&#31243;&#25152;&#26377;&#21442;&#25968;&#8221;</span>
           <span style="color: #696969;">(</span>procedure-environment procedure<span style="color: #696969;">))))</span>
        <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">else</span>
         <span style="color: #696969;">(</span>error
          <span style="color: #deb887;">"Unknown procedure type -- APPLY"</span> procedure<span style="color: #696969;">))))</span>
</pre>
</div>

<p>
增加两个辅助过程：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">list-of-arg-values</span> exps env<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>no-operands? exps<span style="color: #696969;">)</span>
      '<span style="color: #696969;">()</span>
      <span style="color: #696969;">(</span>cons <span style="color: #696969;">(</span>actual-value <span style="color: #696969;">(</span>first-operand exps<span style="color: #696969;">)</span> env<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">&#24378;&#36843;&#27714;&#20540;</span>
            <span style="color: #696969;">(</span>list-of-arg-values <span style="color: #696969;">(</span>rest-operands exps<span style="color: #696969;">)</span>
                                env<span style="color: #696969;">))))</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">list-of-delayed-args</span> exps env<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>no-operands? exps<span style="color: #696969;">)</span>
      '<span style="color: #696969;">()</span>
      <span style="color: #696969;">(</span>cons <span style="color: #696969;">(</span>delay-it <span style="color: #696969;">(</span>first-operand exps<span style="color: #696969;">)</span> env<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">&#24310;&#26102;&#27714;&#20540;</span>
            <span style="color: #696969;">(</span>list-of-delayed-args <span style="color: #696969;">(</span>rest-operands exps<span style="color: #696969;">)</span>
                                  env<span style="color: #696969;">))))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2aef1ba" class="outline-4">
<h4 id="org2aef1ba">修改 eval-if</h4>
<div class="outline-text-4" id="text-org2aef1ba">
<p>
条件表达式的谓词必须是应用序：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">eval-if</span> exp env<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>true? <span style="color: #696969;">(</span>actual-value <span style="color: #696969;">(</span>if-predicate exp<span style="color: #696969;">)</span> env<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">&#24378;&#36843;&#27714;&#20540;&#8220;&#26465;&#20214;&#34920;&#36798;&#24335;&#30340;&#35859;&#35789;&#8221;</span>
      <span style="color: #696969;">(</span>eval <span style="color: #696969;">(</span>if-consequent exp<span style="color: #696969;">)</span> env<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>eval <span style="color: #696969;">(</span>if-alternative exp<span style="color: #696969;">)</span> env<span style="color: #696969;">)))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org77444f1" class="outline-4">
<h4 id="org77444f1">修改驱动循环</h4>
<div class="outline-text-4" id="text-org77444f1">
<p>
输入的表达式必须立刻求值：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">driver-loop</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>prompt-for-input input-prompt<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>input <span style="color: #696969;">(</span>read<span style="color: #696969;">)))</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>output
           <span style="color: #696969;">(</span>actual-value input the-global-environment<span style="color: #696969;">)))</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">&#24378;&#36843;&#27714;&#20540;&#36755;&#20837;&#30340;&#34920;&#36798;&#24335;</span>
      <span style="color: #696969;">(</span>announce-output output-prompt<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>user-print output<span style="color: #696969;">)))</span>
  <span style="color: #696969;">(</span>driver-loop<span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
