html/intepreter/lazy_evalutor.html
<div id="outline-container-orgf25af7c" class="outline-4">
<h4 id="orgf25af7c">槽</h4>
<div class="outline-text-4" id="text-orgf25af7c">
<p>
<span class="underline">槽</span> 作为 <b>数据结构</b> ，它实现了 <b>准备求值的安排</b> ：
</p>
<ul class="org-ul">
<li><b>封装</b> 一个 <span class="underline">表达式</span> 和一个 <span class="underline">环境</span></li>
<li>需要时可以求出表达式的值</li>
<li>简单实现 <b>用一个表把 <span class="underline">表达式</span> 和 <span class="underline">环境</span> 包装起来</b> ：</li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">delay-it</span> exp env<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>list 'thunk exp env<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">thunk?</span> obj<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>tagged-list? obj 'thunk<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">thunk-exp</span> thunk<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>cadr thunk<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">thunk-env</span> thunk<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>caddr thunk<span style="color: #696969;">))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define thunk-object (delay-it '(+ 2 4) (setup-environment))) </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(thunk? thunk-object) ; =&gt; #t</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(thunk-exp thunk-object) ; =&gt; (+ 2 4)</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(thunk-env thunk-object)</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; (((false true car cdr cons null? + &gt;) #f #t (primitive #[compiled-procedure 17 ("list" #x1) #x1a #x184c3e2]) (primitive #[compiled-procedure 18 ("list" #x2) #x1a #x184c452]) (primitive #[compiled-procedure 19 ("list" #x3) #x14 #x184c4bc]) (primitive #[compiled-procedure 20 ("list" #x5) #x14 #x184c55c]) (primitive #[arity-dispatched-procedure 21]) (primitive #[arity-dispatched-procedure 22]))</span>
</pre>
</div>

<p>
强迫求值时应该用 <span class="underline">actual-value</span> 而不是 <span class="underline">eval</span> ，现在的 eval 是 <b>延时</b> 的
</p>
<ul class="org-ul">
<li>强迫求值直到不是槽为止： <span class="underline">force-it</span> 和 <span class="underline">actual-value</span>  <b>相互递归</b></li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">force-it</span> obj<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>thunk? obj<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>actual-value <span style="color: #696969;">(</span>thunk-exp obj<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>thunk-env obj<span style="color: #696969;">))</span>
      obj<span style="color: #696969;">))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(force-it 1) ; =&gt; 1</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(force-it (delay-it '(+ 2 4) (setup-environment))) ; =&gt; 6 </span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">actual-value</span> exp env<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>force-it <span style="color: #696969;">(</span>eval exp env<span style="color: #696969;">)))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(actual-value '(+ 2 4) (setup-environment)) ; =&gt; 6</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define test-environment (setup-environment))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define extended-env (extend-environment</span>
<span style="color: #5f9ea0; font-style: italic;">;;                    </span><span style="color: #5f9ea0; font-style: italic;">'(a b) </span>
<span style="color: #5f9ea0; font-style: italic;">;;                    </span><span style="color: #5f9ea0; font-style: italic;">(list-of-delayed-args '(2 (/ 1 0)) test-environment)</span>
<span style="color: #5f9ea0; font-style: italic;">;;                    </span><span style="color: #5f9ea0; font-style: italic;">test-environment))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(lookup-variable-value 'b extended-env)</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">=&gt; (thunk</span>
<span style="color: #5f9ea0; font-style: italic;">;;      </span><span style="color: #5f9ea0; font-style: italic;">(/ 1 0)</span>
<span style="color: #5f9ea0; font-style: italic;">;;      </span><span style="color: #5f9ea0; font-style: italic;">(((false true car cdr cons null? + &gt;) #f #t (primitive #[compiled-procedure 14 ("list" #x1) #x1a #x19643e2]) (primitive #[compiled-procedure 15 ("list" #x2) #x1a #x1964452]) (primitive #[compiled-procedure 16 ("list" #x3) #x14 #x19644bc]) (primitive #[compiled-procedure 17 ("list" #x5) #x14 #x196455c]) (primitive #[arity-dispatched-procedure 18]) (primitive #[arity-dispatched-procedure 19]))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(actual-value 'b extended-env) ;Unbound variable /</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(force-it (eval 'b extended-env)) ;Unbound variable /</span>
</pre>
</div>
</div>

<div id="outline-container-orgc9529fa" class="outline-5">
<h5 id="orgc9529fa">记忆槽</h5>
<div class="outline-text-5" id="text-orgc9529fa">
<p>
通过修改槽对象来实现带记忆， <b>求值后将其换成得到的值表达式</b> ：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">evaluated-thunk?</span> obj<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>tagged-list? obj 'evaluated-thunk<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">thunk-value</span> evaluated-thunk<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>cadr evaluated-thunk<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">force-it</span> obj<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">cond</span> <span style="color: #696969;">((</span>thunk? obj<span style="color: #696969;">)</span>
         <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>result <span style="color: #696969;">(</span>actual-value
                        <span style="color: #696969;">(</span>thunk-exp obj<span style="color: #696969;">)</span>
                        <span style="color: #696969;">(</span>thunk-env obj<span style="color: #696969;">))))</span>
           <span style="color: #696969;">(</span>set-car! obj 'evaluated-thunk<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#20462;&#25913; trunk &#20026; evaluted-trunk </span>
           <span style="color: #696969;">(</span>set-car! <span style="color: #696969;">(</span>cdr obj<span style="color: #696969;">)</span> result<span style="color: #696969;">)</span>  <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#20462;&#25913;&#34920;&#36798;&#24335;&#20026;&#27714;&#20986;&#30340;&#34920;&#36798;&#24335;</span>
           <span style="color: #696969;">(</span>set-cdr! <span style="color: #696969;">(</span>cdr obj<span style="color: #696969;">)</span> '<span style="color: #696969;">())</span>     <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#19981;&#20877;&#38656;&#35201;&#29615;&#22659;</span>
           result<span style="color: #696969;">))</span>
        <span style="color: #696969;">((</span>evaluated-thunk? obj<span style="color: #696969;">)</span>
         <span style="color: #696969;">(</span>thunk-value obj<span style="color: #696969;">))</span>
        <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">else</span> obj<span style="color: #696969;">)))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define thunk-object (delay-it '(+ 2 4) (setup-environment)))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">thunk-object </span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">=&gt; (thunk (+ 2 4) (((false true car cdr cons null? + &gt;) #f #t (primitive #[compiled-procedure 14 ("list" #x1) #x1a #x19643e2]) (primitive #[compiled-procedure 15 ("list" #x2) #x1a #x1964452]) (primitive #[compiled-procedure 16 ("list" #x3) #x14 #x19644bc]) (primitive #[compiled-procedure 17 ("list" #x5) #x14 #x196455c]) (primitive #[arity-dispatched-procedure 18]) (primitive #[arity-dispatched-procedure 19]))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(force-it thunk-object) ; =&gt; 6</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">thunk-object ; =&gt;  (evaluated-thunk 6)</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(evaluated-thunk? thunk-object) ; =&gt; #t</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(thunk-value thunk-object) ; =&gt; 6</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(force-it thunk-object) ; =&gt; 6 </span>
</pre>
</div>

<pre class="example">
  无论有没有记忆，前面修改过的求值器都能工作
</pre>
</div>
</div>
</div>
